# Напишите программу вывода на экран трех последовательно идущих чисел, каждое на отдельной строке. Первое число вводит пользователь, остальные числа вычисляются в программе.
x = int(input())
y = x + 1
z = y + 1
print(x)
print(y)
print(z)
