# Напишите программу, которая считывает три целых числа и выводит на экран их сумму.
# Каждое число записано в отдельной строке.
x = int(input())
y = int(input())
z = int(input())
print(int(x + y + z))