# Напишите программу, вычисляющую объём куба и площадь его полной поверхности, по введённому значению длины ребра.
a = int(input())
v = a ** 3
s = 6 * a ** 2
print('Объем =', v)
print('Площадь полной поверхности =', s)
