# На вход программе подается одна строка состоящая из цифр.
# Напишите программу, которая считает сумму цифр данной строки.
# Формат входных данных
# На вход программе подается одна строка состоящая из цифр.
# Формат выходных данных
# Программа должна вывести сумму цифр данной строки.
s = input()
print(int(s[0]) + int(s[1]) + int(s[2]) + int(s[3]))

