# На вход программе подается одна строка с буквами русского языка.
# Напишите программу, которая определяет количество гласных и согласных букв.
# Формат входных данных
# На вход программе подается одна строка.
# Формат выходных данных
# Программа должна вывести количество гласных и согласных букв.
# Примечание. В русском языке 10 гласных букв (а, у, о, ы, и, э, я, ю, ё, е)
# и 21 согласная буква (б, в, г, д, ж, з, й, к, л, м, н, п, р, с, т, ф, х, ц, ч, ш, щ).
s = input().lower()
glas = 0
sog = 0
for i in range(len(s)):
    if s[i] == 'а' or s[i] == 'у' or s[i] == 'о' or s[i] == 'ы' or s[i] == 'и' or s[i] == 'э' or s[i] == 'я' or s[i] == 'ю' or s[i] == 'ё' or s[i] == 'е':
        glas += 1
    if s[i] == 'б' or s[i] == 'в' or s[i] == 'г' or s[i] == 'д' or s[i] == 'ж' or s[i] == 'з' or s[i] == 'й' or s[i] == 'к' or s[i] == 'л' or s[i] == 'м' or s[i] == 'н' or s[i] == 'п' or s[i] == 'р' or s[i] == 'с' or s[i] == 'т' or s[i] == 'ф' or s[i] == 'х' or s[i] == 'ц' or s[i] == 'ч' or s[i] == 'ш' or s[i] == 'щ':
        sog += 1
print('Количество гласных букв равно', glas)
print('Количество согласных букв равно', sog)

