# На вход программе подается строка.
# Напишите программу, которая меняет регистр символов, другими словами замените все строчные символы заглавными и наоборот.
# Формат входных данных
# На вход программе подается строка.
# Формат выходных данных
# Программа должна вывести строку в соответствии с условием задачи.
n = input()
print(n.swapcase())

