# На вход программе подается натуральное число n, а затем n строк.
# Напишите программу, которая создает из указанных строк список и выводит его.
# Формат входных данных
# На вход программе подаются натуральное число nnn, а затем nnn строк, каждая на отдельной строке.
# Формат выходных данных
# Программа должна вывести список состоящий из указанных строк.
n = int(input())
my_list = []
for _ in range(n):
    my_list == my_list.append(input())
print(my_list)
